; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	instrument2 - instrument
	satellite1 - satellite
	instrument3 - instrument
	instrument4 - instrument
	instrument5 - instrument
	satellite2 - satellite
	instrument6 - instrument
	instrument7 - instrument
	instrument8 - instrument
	thermograph4 - mode
	thermograph1 - mode
	infrared5 - mode
	infrared2 - mode
	image0 - mode
	spectrograph3 - mode
	Star4 - direction
	Star1 - direction
	GroundStation5 - direction
	Star3 - direction
	Star6 - direction
	Star0 - direction
	Star2 - direction
	Star7 - direction
	Planet8 - direction
	Phenomenon9 - direction
	Star10 - direction
	Planet11 - direction
)
(:init
	(supports instrument0 infrared2)
	(supports instrument0 spectrograph3)
	(supports instrument0 image0)
	(supports instrument0 infrared5)
	(calibration_target instrument0 Star2)
	(calibration_target instrument0 GroundStation5)
	(supports instrument1 thermograph4)
	(supports instrument1 image0)
	(calibration_target instrument1 Star4)
	(supports instrument2 thermograph1)
	(calibration_target instrument2 Star0)
	(calibration_target instrument2 Star1)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(on_board instrument2 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star4)
	(supports instrument3 image0)
	(calibration_target instrument3 Star3)
	(calibration_target instrument3 Star6)
	(supports instrument4 thermograph4)
	(supports instrument4 image0)
	(calibration_target instrument4 GroundStation5)
	(calibration_target instrument4 Star2)
	(supports instrument5 thermograph1)
	(supports instrument5 thermograph4)
	(calibration_target instrument5 Star3)
	(calibration_target instrument5 GroundStation5)
	(on_board instrument3 satellite1)
	(on_board instrument4 satellite1)
	(on_board instrument5 satellite1)
	(power_avail satellite1)
	(pointing satellite1 GroundStation5)
	(supports instrument6 image0)
	(supports instrument6 infrared2)
	(supports instrument6 thermograph4)
	(calibration_target instrument6 Star2)
	(calibration_target instrument6 Star6)
	(supports instrument7 infrared2)
	(calibration_target instrument7 Star0)
	(supports instrument8 infrared2)
	(supports instrument8 spectrograph3)
	(calibration_target instrument8 Star2)
	(on_board instrument6 satellite2)
	(on_board instrument7 satellite2)
	(on_board instrument8 satellite2)
	(power_avail satellite2)
	(pointing satellite2 Star1)
)
(:goal (and
	(pointing satellite0 Star2)
	(pointing satellite2 Planet11)
	(have_image Star7 infrared2)
	(have_image Star7 thermograph4)
	(have_image Planet8 spectrograph3)
	(have_image Planet8 infrared2)
	(have_image Phenomenon9 thermograph1)
	(have_image Phenomenon9 infrared5)
	(have_image Star10 infrared5)
	(have_image Star10 infrared2)
	(have_image Planet11 infrared2)
	(have_image Planet11 thermograph1)
))

)

; plan
1. (turn_to satellite2 planet11 star1)
   deleted: (pointing satellite2 star1)
   added: (pointing satellite2 planet11)
   goals met: 1 of 12
2. (switch_on instrument5 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument5)
   goals met: 1 of 12
3. (calibrate satellite1 instrument5 groundstation5)
   added: (calibrated instrument5)
   goals met: 1 of 12
4. (turn_to satellite1 star7 groundstation5)
   deleted: (pointing satellite1 groundstation5)
   added: (pointing satellite1 star7)
   goals met: 1 of 12
5. (take_image satellite1 star7 instrument5 thermograph4)
   added: (have_image star7 thermograph4)
   goals met: 2 of 12
6. (turn_to satellite1 planet11 star7)
   deleted: (pointing satellite1 star7)
   added: (pointing satellite1 planet11)
   goals met: 2 of 12
7. (take_image satellite1 planet11 instrument5 thermograph1)
   added: (have_image planet11 thermograph1)
   goals met: 3 of 12
8. (turn_to satellite1 phenomenon9 planet11)
   deleted: (pointing satellite1 planet11)
   added: (pointing satellite1 phenomenon9)
   goals met: 3 of 12
9. (turn_to satellite0 groundstation5 star4)
   deleted: (pointing satellite0 star4)
   added: (pointing satellite0 groundstation5)
   goals met: 3 of 12
10. (take_image satellite1 phenomenon9 instrument5 thermograph1)
   added: (have_image phenomenon9 thermograph1)
   goals met: 4 of 12
11. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 4 of 12
12. (calibrate satellite0 instrument0 groundstation5)
   added: (calibrated instrument0)
   goals met: 4 of 12
13. (turn_to satellite0 phenomenon9 groundstation5)
   deleted: (pointing satellite0 groundstation5)
   added: (pointing satellite0 phenomenon9)
   goals met: 4 of 12
14. (take_image satellite0 phenomenon9 instrument0 infrared5)
   added: (have_image phenomenon9 infrared5)
   goals met: 5 of 12
15. (turn_to satellite0 planet11 phenomenon9)
   deleted: (pointing satellite0 phenomenon9)
   added: (pointing satellite0 planet11)
   goals met: 5 of 12
16. (take_image satellite0 planet11 instrument0 infrared2)
   added: (have_image planet11 infrared2)
   goals met: 6 of 12
17. (turn_to satellite0 planet8 planet11)
   deleted: (pointing satellite0 planet11)
   added: (pointing satellite0 planet8)
   goals met: 6 of 12
18. (take_image satellite0 planet8 instrument0 infrared2)
   added: (have_image planet8 infrared2)
   goals met: 7 of 12
19. (take_image satellite0 planet8 instrument0 spectrograph3)
   added: (have_image planet8 spectrograph3)
   goals met: 8 of 12
20. (turn_to satellite0 star10 planet8)
   deleted: (pointing satellite0 planet8)
   added: (pointing satellite0 star10)
   goals met: 8 of 12
21. (take_image satellite0 star10 instrument0 infrared2)
   added: (have_image star10 infrared2)
   goals met: 9 of 12
22. (take_image satellite0 star10 instrument0 infrared5)
   added: (have_image star10 infrared5)
   goals met: 10 of 12
23. (turn_to satellite0 star7 star10)
   deleted: (pointing satellite0 star10)
   added: (pointing satellite0 star7)
   goals met: 10 of 12
24. (take_image satellite0 star7 instrument0 infrared2)
   added: (have_image star7 infrared2)
   goals met: 11 of 12
25. (turn_to satellite0 star2 star7)
   deleted: (pointing satellite0 star7)
   added: (pointing satellite0 star2)
   goals met: 12 of 12
